day02/04sampling/00baseCase/system/sample
FoamFile
{
format      ascii;
class       dictionary;
location    "system";
object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
data
{
    type    lineUniform;
    axis    x;
    start   (-4.995 0 0);
    end     (4.995 0 0);
    nPoints 1000;
}
);

fields          (T mag(U) p);
